# Setup

In [1]:
%load_ext sql

There's a new jupysql version available (0.10.4), you're running 0.10.3. To upgrade: pip install jupysql --upgrade

In [2]:
import requests

url = "https://rtvad.blob.core.windows.net/misc-data/northwind.sqlite3"
response = requests.get(url)

with open("northwind.sqlite3", "wb") as file:
    file.write(response.content)

In [3]:
%sql sqlite:///northwind.sqlite3

Connecting to 'sqlite:///northwind.sqlite3'

# Exercícios

Exercício 1:
Listar todos os clientes e seus respectivos pedidos.

In [4]:
%%sql

SELECT Customers.CustomerID, Customers.ContactName, Orders.OrderID
FROM Customers
LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
ORDER BY Customers.CustomerID, Orders.OrderID;

Running query in 'sqlite:///northwind.sqlite3'

+------------+--------------+---------+
| CustomerID | ContactName  | OrderID |
+------------+--------------+---------+
|   ALFKI    | Maria Anders |  10643  |
|   ALFKI    | Maria Anders |  10692  |
|   ALFKI    | Maria Anders |  10702  |
|   ALFKI    | Maria Anders |  10835  |
|   ALFKI    | Maria Anders |  10952  |
|   ALFKI    | Maria Anders |  11011  |
|   ANATR    | Ana Trujillo |  10308  |
|   ANATR    | Ana Trujillo |  10625  |
|   ANATR    | Ana Trujillo |  10759  |
|   ANATR    | Ana Trujillo |  10926  |
+------------+--------------+---------+
Truncated to displaylimit of 10.

Exercício 2:
Listar todos os pedidos feitos por um cliente específico.

In [7]:
%%sql

SELECT CustomerID, OrderID, OrderDate
FROM Orders
WHERE CustomerID = 'VINET'

Running query in 'sqlite:///northwind.sqlite3'

+------------+---------+-------------------------+
| CustomerID | OrderID |        OrderDate        |
+------------+---------+-------------------------+
|   VINET    |  10248  | 2014-07-04 08:00:00.000 |
|   VINET    |  10274  | 2014-08-06 12:00:00.000 |
|   VINET    |  10295  | 2014-09-02 08:00:00.000 |
|   VINET    |  10737  | 2015-11-11 13:00:00.000 |
|   VINET    |  10739  | 2015-11-12 10:00:00.000 |
+------------+---------+-------------------------+

Exercício 3:
Listar todos os produtos e seus respectivos fornecedores.

In [10]:
%%sql

SELECT Products.ProductName, Suppliers.CompanyName
FROM Products
INNER JOIN Suppliers ON Products.SupplierID = Suppliers.SupplierID
ORDER BY Products.ProductName;

Running query in 'sqlite:///northwind.sqlite3'

+------------------------------+-----------------------------+
|         ProductName          |         CompanyName         |
+------------------------------+-----------------------------+
|         Alice Mutton         |        Pavlova, Ltd.        |
|        Aniseed Syrup         |        Exotic Liquids       |
|       Boston Crab Meat       | New England Seafood Cannery |
|      Camembert Pierrot       |         Gai pâturage        |
|       Carnarvon Tigers       |        Pavlova, Ltd.        |
|             Chai             |        Exotic Liquids       |
|            Chang             |        Exotic Liquids       |
|       Chartreuse verte       |  Aux joyeux ecclésiastiques |
| Chef Anton's Cajun Seasoning |  New Orleans Cajun Delights |
|    Chef Anton's Gumbo Mix    |  New Orleans Cajun Delights |
+------------------------------+-----------------------------+
Truncated to displaylimit of 10.

Exercício 4:
Listar todos os produtos de uma determinada categoria.

In [12]:
%%sql

SELECT P.ProductName, C.CategoryName
FROM Products P
INNER JOIN Categories C
ON P.CategoryID = C.CategoryID
WHERE CategoryName = 'Seafood'

Running query in 'sqlite:///northwind.sqlite3'

+---------------------------------+--------------+
|           ProductName           | CategoryName |
+---------------------------------+--------------+
|              Ikura              |   Seafood    |
|              Konbu              |   Seafood    |
|         Carnarvon Tigers        |   Seafood    |
|      Nord-Ost Matjeshering      |   Seafood    |
|           Inlagd Sill           |   Seafood    |
|            Gravad lax           |   Seafood    |
|         Boston Crab Meat        |   Seafood    |
| Jack's New England Clam Chowder |   Seafood    |
|           Rogede sild           |   Seafood    |
|            Spegesild            |   Seafood    |
+---------------------------------+--------------+
Truncated to displaylimit of 10.

Exercício 5:
Listar todos os pedidos entregues por determinada transportadora (explore a tabela para escolher uma transportadora)

In [14]:
%%sql

SELECT *
FROM Shippers

Running query in 'sqlite:///northwind.sqlite3'

+-----------+------------------+----------------+
| ShipperID |   CompanyName    |     Phone      |
+-----------+------------------+----------------+
|     1     |  Speedy Express  | (503) 555-9831 |
|     2     |  United Package  | (503) 555-3199 |
|     3     | Federal Shipping | (503) 555-9931 |
+-----------+------------------+----------------+

In [17]:
%%sql

SELECT *
FROM Orders

Running query in 'sqlite:///northwind.sqlite3'

+---------+------------+------------+-------------------------+-------------------------+-------------------------+---------+---------+---------------------------+--------------------------------------------+----------------+------------+----------------+-------------+
| OrderID | CustomerID | EmployeeID |        OrderDate        |       RequiredDate      |       ShippedDate       | ShipVia | Freight |          ShipName         |                ShipAddress                 |    ShipCity    | ShipRegion | ShipPostalCode | ShipCountry |
+---------+------------+------------+-------------------------+-------------------------+-------------------------+---------+---------+---------------------------+--------------------------------------------+----------------+------------+----------------+-------------+
|  10248  |   VINET    |     5      | 2014-07-04 08:00:00.000 | 2014-08-01 00:00:00.000 | 2014-07-16 00:00:00.000 |    3    |  32.38  | Vins et alcools Chevalier |             59 rue de l'Abbaye             |     Reims      |    None    |     51100      |    France   |
|  10249  |   TOMSP    |     6      | 2014-07-05 04:00:00.000 | 2014-08-16 00:00:00.000 | 2014-07-10 00:00:00.000 |    1    |  11.61  |     Toms Spezialitäten    |               Luisenstr. 48                |    Münster     |    None    |     44087      |   Germany   |
|  10250  |   HANAR    |     4      | 2014-07-08 15:00:00.000 | 2014-08-05 00:00:00.000 | 2014-07-12 00:00:00.000 |    2    |  65.83  |       Hanari Carnes       |              Rua do Paço, 67               | Rio de Janeiro |     RJ     |   05454-876    |    Brazil   |
|  10251  |   VICTE    |     3      | 2014-07-08 14:00:00.000 | 2014-08-05 00:00:00.000 | 2014-07-15 00:00:00.000 |    1    |  41.34  |    Victuailles en stock   |             2, rue du Commerce             |      Lyon      |    None    |     69004      |    France   |
|  10252  |   SUPRD    |     4      | 2014-07-09 01:00:00.000 | 2014-08-06 00:00:00.000 | 2014-07-11 00:00:00.000 |    2    |   51.3  |      Suprêmes délices     |            Boulevard Tirou, 255            |   Charleroi    |    None    |     B-6000     |   Belgium   |
|  10253  |   HANAR    |     3      | 2014-07-10 08:00:00.000 | 2014-07-24 00:00:00.000 | 2014-07-16 00:00:00.000 |    2    |  58.17  |       Hanari Carnes       |              Rua do Paço, 67               | Rio de Janeiro |     RJ     |   05454-876    |    Brazil   |
|  10254  |   CHOPS    |     5      | 2014-07-11 02:00:00.000 | 2014-08-08 00:00:00.000 | 2014-07-23 00:00:00.000 |    2    |  22.98  |     Chop-suey Chinese     |                Hauptstr. 31                |      Bern      |    None    |      3012      | Switzerland |
|  10255  |   RICSU    |     9      | 2014-07-12 20:00:00.000 | 2014-08-09 00:00:00.000 | 2014-07-15 00:00:00.000 |    3    |  148.33 |     Richter Supermarkt    |                Starenweg 5                 |     Genève     |    None    |      1204      | Switzerland |
|  10256  |   WELLI    |     3      | 2014-07-15 22:00:00.000 | 2014-08-12 00:00:00.000 | 2014-07-17 00:00:00.000 |    2    |  13.97  |   Wellington Importadora  |             Rua do Mercado, 12             |    Resende     |     SP     |   08737-363    |    Brazil   |
|  10257  |   HILAA    |     4      | 2014-07-16 15:00:00.000 | 2014-08-13 00:00:00.000 | 2014-07-22 00:00:00.000 |    3    |  81.91  |      HILARION-Abastos     | Carrera 22 con Ave. Carlos Soublette #8-35 | San Cristóbal  |  Táchira   |      5022      |  Venezuela  |
+---------+------------+------------+-------------------------+-------------------------+-------------------------+---------+---------+---------------------------+--------------------------------------------+----------------+------------+----------------+-------------+
Truncated to displaylimit of 10.

In [22]:
%%sql

SELECT Orders.OrderID, Orders.OrderDate, Shippers.CompanyName
FROM Orders
INNER JOIN Shippers ON Orders.ShipVia = Shippers.ShipperID
WHERE Shippers.ShipperID = 1

Running query in 'sqlite:///northwind.sqlite3'

+---------+-------------------------+----------------+
| OrderID |        OrderDate        |  CompanyName   |
+---------+-------------------------+----------------+
|  10249  | 2014-07-05 04:00:00.000 | Speedy Express |
|  10251  | 2014-07-08 14:00:00.000 | Speedy Express |
|  10258  | 2014-07-17 00:00:00.000 | Speedy Express |
|  10260  | 2014-07-19 09:00:00.000 | Speedy Express |
|  10265  | 2014-07-25 21:00:00.000 | Speedy Express |
|  10267  | 2014-07-29 14:00:00.000 | Speedy Express |
|  10269  | 2014-07-31 00:00:00.000 | Speedy Express |
|  10270  | 2014-08-01 19:00:00.000 | Speedy Express |
|  10274  | 2014-08-06 12:00:00.000 | Speedy Express |
|  10275  | 2014-08-07 06:00:00.000 | Speedy Express |
+---------+-------------------------+----------------+
Truncated to displaylimit of 10.

Exercício 6: Listar todos os clientes que fizeram um pedido após uma determinada data (explore a tabela para descobrir os períodos e defina uma data)

In [25]:
%%sql

SELECT DISTINCT Customers.CustomerID, Customers.ContactName
FROM Customers
INNER JOIN Orders ON Customers.CustomerID = Orders.CustomerID
WHERE Orders.OrderDate > '2015-01-01'

Running query in 'sqlite:///northwind.sqlite3'

+------------+---------------------+
| CustomerID |     ContactName     |
+------------+---------------------+
|   RATTC    |     Paula Wilson    |
|   EASTC    |      Ann Devon      |
|   ERNSH    |    Roland Mendel    |
|   MAGAA    |   Giovanni Rovelli  |
|   LINOD    |   Felipe Izquierdo  |
|   QUEEN    |    Lúcia Carvalho   |
|   OTTIK    | Henriette Pfalzheim |
|   FOLIG    |    Martine Rancé    |
|   OCEAN    |    Yvonne Moncada   |
|   BOTTM    |  Elizabeth Lincoln  |
+------------+---------------------+
Truncated to displaylimit of 10.

Exercício 7:
Listar todos os produtos que estão em estoque e que precisam ser reabastecidos

In [26]:
%%sql

SELECT ProductName, UnitsInStock, ReorderLevel
FROM Products
WHERE ReorderLevel > UnitsInStock

Running query in 'sqlite:///northwind.sqlite3'

+-----------------------+--------------+--------------+
|      ProductName      | UnitsInStock | ReorderLevel |
+-----------------------+--------------+--------------+
|         Chang         |      17      |      25      |
|     Aniseed Syrup     |      13      |      25      |
|     Queso Cabrales    |      22      |      30      |
|  Sir Rodney's Scones  |      3       |      5       |
| Nord-Ost Matjeshering |      10      |      15      |
|   Gorgonzola Telino   |      0       |      20      |
|   Mascarpone Fabioli  |      9       |      25      |
|       Gravad lax      |      11      |      25      |
|      Ipoh Coffee      |      17      |      25      |
|      Rogede sild      |      5       |      15      |
+-----------------------+--------------+--------------+
Truncated to displaylimit of 10.

Exercício 8: Listar todos os funcionários e seus respectivos supervisores.

In [30]:
%%sql

SELECT 
    e1.EmployeeID AS FuncionarioID, 
    e1.FirstName AS FuncionarioPrimeiroNome,
    e1.LastName AS FuncionarioUltimoNome,
    e2.EmployeeID AS SupervisorID, 
    e2.FirstName AS SupervisorPrimeiroNome,
    e2.LastName AS SupervisorUltimoNome
FROM Employees e1
LEFT JOIN Employees e2 ON e1.ReportsTo = e2.EmployeeID
ORDER BY FuncionarioID

Running query in 'sqlite:///northwind.sqlite3'

+---------------+-------------------------+-----------------------+--------------+------------------------+----------------------+
| FuncionarioID | FuncionarioPrimeiroNome | FuncionarioUltimoNome | SupervisorID | SupervisorPrimeiroNome | SupervisorUltimoNome |
+---------------+-------------------------+-----------------------+--------------+------------------------+----------------------+
|       1       |          Nancy          |        Davolio        |      2       |         Andrew         |        Fuller        |
|       2       |          Andrew         |         Fuller        |     None     |          None          |         None         |
|       3       |          Janet          |       Leverling       |      2       |         Andrew         |        Fuller        |
|       4       |         Margaret        |        Peacock        |      2       |         Andrew         |        Fuller        |
|       5       |          Steven         |        Buchanan       |      2       |         Andrew         |        Fuller        |
|       6       |         Michael         |         Suyama        |      5       |         Steven         |       Buchanan       |
|       7       |          Robert         |          King         |      5       |         Steven         |       Buchanan       |
|       8       |          Laura          |        Callahan       |      2       |         Andrew         |        Fuller        |
|       9       |           Anne          |       Dodsworth       |      5       |         Steven         |       Buchanan       |
+---------------+-------------------------+-----------------------+--------------+------------------------+----------------------+

Exercício 9: Listar todos os fornecedores e seus respectivos produtos.

In [33]:
%%sql

SELECT Suppliers.CompanyName, Products.ProductName
FROM Suppliers
LEFT JOIN Products ON Suppliers.SupplierID = Products.SupplierID

Running query in 'sqlite:///northwind.sqlite3'

+------------------------------------+---------------------------+
|            CompanyName             |        ProductName        |
+------------------------------------+---------------------------+
|     Aux joyeux ecclésiastiques     |       Côte de Blaye       |
|     Aux joyeux ecclésiastiques     |      Chartreuse verte     |
|         Bigfoot Breweries          |       Sasquatch Ale       |
|         Bigfoot Breweries          |       Steeleye Stout      |
|         Bigfoot Breweries          | Laughing Lumberjack Lager |
| Cooperativa de Quesos 'Las Cabras' |       Queso Cabrales      |
| Cooperativa de Quesos 'Las Cabras' | Queso Manchego La Pastora |
|         Escargots Nouveaux         |   Escargots de Bourgogne  |
|           Exotic Liquids           |            Chai           |
|           Exotic Liquids           |           Chang           |
+------------------------------------+---------------------------+
Truncated to displaylimit of 10.

Exercício 10:
Listar o total de vendas por cliente.

In [37]:
%%sql

SELECT C.CustomerID, C.CompanyName, SUM(OD.Quantity * OD.UnitPrice) AS TotalVendas
FROM Customers C
LEFT JOIN Orders O ON C.CustomerID = O.CustomerID
LEFT JOIN OrderDetails OD ON O.OrderID = OD.OrderID
GROUP BY C.CustomerID, C.ContactName
ORDER BY TotalVendas DESC

Running query in 'sqlite:///northwind.sqlite3'

+------------+------------------------------+--------------------+
| CustomerID |         CompanyName          |    TotalVendas     |
+------------+------------------------------+--------------------+
|   QUICK    |          QUICK-Stop          | 117483.39000000001 |
|   SAVEA    |      Save-a-lot Markets      |     115673.39      |
|   ERNSH    |         Ernst Handel         |     113601.88      |
|   HUNGO    | Hungry Owl All-Night Grocers |      57317.39      |
|   RATTC    |  Rattlesnake Canyon Grocery  |      52245.9       |
|   HANAR    |        Hanari Carnes         |      34101.15      |
|   FOLKO    |        Folk och fä HB        |      32555.55      |
|   MEREP    |        Mère Paillarde        |      32203.9       |
|   KOENE    |       Königlich Essen        |      31745.75      |
|   QUEEN    |        Queen Cozinha         | 30226.099999999995 |
+------------+------------------------------+--------------------+
Truncated to displaylimit of 10.